---
kind: property
id: P:Autodesk.Revit.DB.PolylineSegments.StartLocalParameter
source: html/5043c0e4-6806-0cf6-94b6-6475f95f200a.htm
---
# Autodesk.Revit.DB.PolylineSegments.StartLocalParameter Property

Local parameter associated with the start point.

## Syntax (C#)
```csharp
public double StartLocalParameter { get; }
```